tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "shopify/shopify"

brew "asdf"
brew "bat" # fancy 'cat' replacement
brew "exa" # fancy 'ls' replacement
brew "fd" # fancy 'find' replacement
brew "fish"
brew "fzf"
brew "gawk" # required by asdf node.js plugin
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gnupg"
brew "htop"
brew "jq"
brew "lastpass-cli"
brew "mas"
brew "neofetch"
brew "neovim"
brew "python"
brew "ripgrep" # fancy "grep" replacement
brew "ruby" # required by shopify-cli
brew "shopify-cli"
brew "starship"
brew "themekit"
brew "terraform"
brew "vercel-cli"
brew "yadm"
brew "zoxide"

cask "1password-beta" 
cask "1password-cli-beta"

cask "docker"
cask "elgato-stream-deck"
cask "fantastical"
cask "figma"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "google-chrome"
cask "iina" # video player
cask "iterm2"
cask "little-snitch"
cask "loom"
cask "notion"
cask "obsidian"
cask "rectangle"
# cask "slack" # installed directly
cask "stats"
cask "steelseries-gg"
cask "visual-studio-code"
cask "zoom"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
